{
  "items": [
    {
      "id": "d9b919e4-1fc4-4545-b43b-cc4951f00bbe",
      "url": "https://strikemag.org/bullshit-jobs/",
      "type": "article",
      "title": "STRIKE! Magazine – On the Phenomenon of Bullshit Jobs: A Work Rant",
      "content": "<div>\n        <p>In the year 1930, John Maynard Keynes predicted that, by century's end, technology would have advanced sufficiently that countries like Great Britain or the United States would have achieved a 15-hour work week. There's every reason to believe he was right. In technological terms, we are quite capable of this. And yet it didn't happen. Instead, technology has been marshaled, if anything, to figure out ways to make us all work more. In order to achieve this, jobs have had to be created that are, effectively, pointless. Huge swathes of people, in Europe and North America in particular, spend their entire working lives performing tasks they secretly believe do not really need to be performed. The moral and spiritual damage that comes from this situation is profound. It is a scar across our collective soul. Yet virtually no one talks about it.</p>\n<p>Why did Keynes' promised utopia—still being eagerly awaited in the '60s—never materialise? The standard line today is that he didn't figure in the massive increase in consumerism. Given the choice between less hours and more toys and pleasures, we've collectively chosen the latter. This presents a nice morality tale, but even a moment's reflection shows it can't really be true. Yes, we have witnessed the creation of an endless variety of new jobs and industries since the '20s, but very few have anything to do with the production and distribution of sushi, iPhones, or fancy sneakers.</p>\n<p>So what are these new jobs, precisely? A recent report comparing employment in the US between 1910 and 2000 gives us a clear picture (and I note, one pretty much exactly echoed in the UK). Over the course of the last century, the number of workers employed as domestic servants, in industry, and in the farm sector has collapsed dramatically. At the same time, ‘professional, managerial, clerical, sales, and service workers’ tripled, growing ‘from one-quarter to three-quarters of total employment.’ In other words, productive jobs have, just as predicted, been largely automated away (even if you count industrial workers globally, including the toiling masses in India and China, such workers are still not nearly so large a percentage of the world population as they used to be.)</p>\n<p>But rather than allowing a massive reduction of working hours to free the world's population to pursue their own projects, pleasures, visions, and ideas, we have seen the ballooning of not even so much of the ‘service’ sector as of the administrative sector, up to and including the creation of whole new industries like financial services or telemarketing, or the unprecedented expansion of sectors like corporate law, academic and health administration, human resources, and public relations. And these numbers do not even reflect on all those people whose job is to provide administrative, technical, or security support for these industries, or for that matter the whole host of ancillary industries (dog-washers, all-night pizza delivery) that only exist because everyone else is spending so much of their time working in all the other ones.</p>\n<p>These are what I propose to call ‘bullshit jobs’.</p>\n<p>It's as if someone were out there making up pointless jobs just for the sake of keeping us all working. And here, precisely, lies the mystery. In capitalism, this is precisely what is not supposed to happen. Sure, in the old inefficient socialist states like the Soviet Union, where employment was considered both a right and a sacred duty, the system made up as many jobs as they had to (this is why in Soviet department stores it took three clerks to sell a piece of meat). But, of course, this is the sort of very problem market competition is supposed to fix. According to economic theory, at least, the last thing a profit-seeking firm is going to do is shell out money to workers they don't really need to employ. Still, somehow, it happens.</p>\n<p>While corporations may engage in ruthless downsizing, the layoffs and speed-ups invariably fall on that class of people who are actually making, moving, fixing and maintaining things; through some strange alchemy no one can quite explain, the number of salaried paper-pushers ultimately seems to expand, and more and more employees find themselves, not unlike Soviet workers actually, working 40 or even 50 hour weeks on paper, but effectively working 15 hours just as Keynes predicted, since the rest of their time is spent organizing or attending motivational seminars, updating their facebook profiles or downloading TV box-sets.</p>\n<p>The answer clearly isn't economic: it's moral and political. The ruling class has figured out that a happy and productive population with free time on their hands is a mortal danger (think of what started to happen when this even began to be approximated in the '60s). And, on the other hand, the feeling that work is a moral value in itself, and that anyone not willing to submit themselves to some kind of intense work discipline for most of their waking hours deserves nothing, is extraordinarily convenient for them.</p>\n<p>Once, when contemplating the apparently endless growth of administrative responsibilities in British academic departments, I came up with one possible vision of hell. Hell is a collection of individuals who are spending the bulk of their time working on a task they don't like and are not especially good at. Say they were hired because they were excellent cabinet-makers, and then discover they are expected to spend a great deal of their time frying fish. Neither does the task really need to be done—at least, there's only a very limited number of fish that need to be fried. Yet somehow, they all become so obsessed with resentment at the thought that some of their co-workers might be spending more time making cabinets, and not doing their fair share of the fish-frying responsibilities, that before long there's endless piles of useless badly cooked fish piling up all over the workshop and it's all that anyone really does. I think this is actually a pretty accurate description of the moral dynamics of our own economy.</p>\n<p>Now, I realise any such argument is going to run into immediate objections: ‘who are you to say what jobs are really “necessary”? What's necessary anyway? You're an anthropology professor, what's the “need” for that?’ (And indeed a lot of tabloid readers would take the existence of my job as the very definition of wasteful social expenditure.) And on one level, this is obviously true. There can be no objective measure of social value.</p>\n<p>I would not presume to tell someone who is convinced they are making a meaningful contribution to the world that, really, they are not. But what about those people who are themselves convinced their jobs are meaningless? Not long ago I got back in touch with a school friend who I hadn't seen since I was 12. I was amazed to discover that in the interim, he had become first a poet, then the front man in an indie rock band. I'd heard some of his songs on the radio having no idea the singer was someone I actually knew. He was obviously brilliant, innovative, and his work had unquestionably brightened and improved the lives of people all over the world. Yet, after a couple of unsuccessful albums, he'd lost his contract, and plagued with debts and a newborn daughter, ended up, as he put it, ‘taking the default choice of so many directionless folk: law school.’ Now he's a corporate lawyer working in a prominent New York firm. He was the first to admit that his job was utterly meaningless, contributed nothing to the world, and, in his own estimation, should not really exist.</p>\n<p>There's a lot of questions one could ask here, starting with, what does it say about our society that it seems to generate an extremely limited demand for talented poet-musicians, but an apparently infinite demand for specialists in corporate law? (Answer: if 1% of the population controls most of the disposable wealth, what we call ‘the market’ reflects what they think is useful or important, not anybody else.) But even more, it shows that most people in these jobs are ultimately aware of it. In fact, I'm not sure I've ever met a corporate lawyer who didn't think their job was bullshit. The same goes for almost all the new industries outlined above. There is a whole class of salaried professionals that, should you meet them at parties and admit that you do something that might be considered interesting (an anthropologist, for example), will want to avoid even discussing their line of work entirely (one or t'other?) Give them a few drinks, and they will launch into tirades about how pointless and stupid their job really is.</p>\n<p>This is a profound psychological violence here. How can one even begin to speak of dignity in labour when one secretly feels one's job should not exist? How can it not create a sense of deep rage and resentment. Yet it is the peculiar genius of our society that its rulers have figured out a way, as in the case of the fish-fryers, to ensure that rage is directed precisely against those who actually do get to do meaningful work. For instance: in our society, there seems a general rule that, the more obviously one's work benefits other people, the less one is likely to be paid for it. Again, an objective measure is hard to find, but one easy way to get a sense is to ask: what would happen were this entire class of people to simply disappear? Say what you like about nurses, garbage collectors, or mechanics, it's obvious that were they to vanish in a puff of smoke, the results would be immediate and catastrophic. A world without teachers or dock-workers would soon be in trouble, and even one without science fiction writers or ska musicians would clearly be a lesser place. It's not entirely clear how humanity would suffer were all private equity CEOs, lobbyists, PR researchers, actuaries, telemarketers, bailiffs or legal consultants to similarly vanish. (Many suspect it might markedly improve.) Yet apart from a handful of well-touted exceptions (doctors), the rule holds surprisingly well.</p>\n<p>Even more perverse, there seems to be a broad sense that this is the way things should be. This is one of the secret strengths of right-wing populism. You can see it when tabloids whip up resentment against tube workers for paralysing London during contract disputes: the very fact that tube workers can paralyse London shows that their work is actually necessary, but this seems to be precisely what annoys people. It's even clearer in the US, where Republicans have had remarkable success mobilizing resentment against school teachers, or auto workers (and not, significantly, against the school administrators or auto industry managers who actually cause the problems) for their supposedly bloated wages and benefits. It's as if they are being told ‘but you get to teach children! Or make cars! You get to have real jobs! And on top of that you have the nerve to also expect middle-class pensions and health care?’</p>\n<p>If someone had designed a work regime perfectly suited to maintaining the power of finance capital, it's hard to see how they could have done a better job. Real, productive workers are relentlessly squeezed and exploited. The remainder are divided between a terrorised stratum of the, universally reviled, unemployed and a larger stratum who are basically paid to do nothing, in positions designed to make them identify with the perspectives and sensibilities of the ruling class (managers, administrators, etc.)—and particularly its financial avatars—but, at the same time, foster a simmering resentment against anyone whose work has clear and undeniable social value. Clearly, the system was never consciously designed. It emerged from almost a century of trial and error. But it is the only explanation for why, despite our technological capacities, we are not all working 3–4 hour days.</p>\n        <div>\n            <figure>\n              <a href=\"http://strikemag.bigcartel.com/product/strike-anthology-1-8\">\n                <img src=\"https://strikemag.org/thumbs/magazine/issue-3/03-spread-01-500x684-q100.jpg\" alt=\"STRIKE! Issue 3\">\n              </a>\n              <figcaption>\n                Printed in Issue 3 The Summer&nbsp;Of...                  <p>\n                  <a href=\"http://strikemag.bigcartel.com/product/strike-anthology-1-8\">Get it here</a></p></figcaption>\n            </figure>\n          </div>\n      </div>",
      "author": "@strikeyo",
      "description": "",
      "dateAdded": "2025-02-18T08:07:23.060Z",
      "media": {
        "images": [
          {
            "url": "https://strikemag.org/content/2-magazine/20130817-issue-3/20130817-bullshit-jobs/bullshitjobs.jpg",
            "alt": "STRIKE! Magazine – On the Phenomenon of Bullshit Jobs: A Work Rant",
            "isHero": true
          }
        ],
        "videos": []
      }
    },
    {
      "id": "c1e75e5f-de10-4cd7-8e43-0a1e4d69b280",
      "url": "https://beneaththepavement.substack.com/p/you-will-never-be-a-billionaire",
      "type": "article",
      "title": "You will never be a billionaire you stupid fuck",
      "content": "<div><p><strong>You honestly believe you might get there one day, don’t you?</strong></p><p>That if you just grind hard enough, hustle longer, keep your nose to the never-ending wheel, snort some cocaine, you’ll strike gold—some multi-million-dollar jackpot that will escalate your life into the billionaire orbit. You’ll buy mansions, fly private, land a feature in Forbes, and the whole world will finally see you for the visionary you are.</p><p><span>THEY WILL SEE YOU FOR WHAT YOU’VE ALWAYS BEEN. A STRONG MAN, AN ABLE MAN. </span><strong>THE PEAK OF MOTHERFUCKING MASCULINITY.</strong></p><p><span>Let me cut the shit for you: </span><strong>You will never be a billionaire.</strong><span> You are not part of the club. You never were, never will be. The entire system you’re propping up with sweat, blood, time, dignity—</span><em>your whole fucking life</em><span>—has zero intention of letting you ascend the throne. It doesn’t matter how many motivational posters you pin on your depressing cubicle wall, or how many times you read think pieces about “10 Habits of Self-Made Millionaires.” The biggest con capitalism ever sold you is the idea that you, too, can become one of the overlords.</span></p><p><span>Yet you cannot accept. </span><strong>YOU MUST BE ONE OF THEM.</strong></p><p><span>You wake at dawn, hustle to two or three jobs, and blame yourself when it doesn’t pan out. You internalize every self-help seminar, every YouTube “guru” telling you to “manifest that dream,” because if you fail, it must be your fault, right? You just need more grit, more devotion. Guess what? None of that hustle is going to breach the golden gates. Their wealth is compounding at obscene rates, while you’re drowning in monthly bills, credit card debt, and groceries that used to cost half of what they do now. Wages barely rise an inch, but the cost of everything else skyrockets like a fucking rocket fueled by your regrets. </span><strong>They humiliate you, keep you down, and yet you keep licking those delicious boots</strong><span>, slowly turning into what you always wanted to be: a fascist. The ultimate power fantasy of the weak man.</span></p><p><span>The US is especially adept at selling these lies. </span><strong>The American Dream is the biggest farce of them all.</strong><span> It’s a centuries-old propaganda machine perpetuated to keep you docile, keep you striving. Because the moment you realize you’re not actually going to make it into their exclusive club, you might do the unthinkable:</span></p><p><strong>Link arms with others in your position, your sisters and brothers in arms, start asking uncomfortable questions, start demanding real change, start tearing this shit down!</strong></p><p><span>And they can’t have that. </span><em>They absolutely cannot have that</em><span>. It’s so much easier to feed you illusions of grandeur, illusions of that house with a picket fence, three perfect blonde children, and the brand-new Tesla in your driveway, illusions that your hard work and moral fortitude will pay off.</span></p><p><span>It’s an </span><strong>exclusive club</strong><span>. They’re born into it. They marry into it. Occasionally, they let in a freak example of the “self-made” billionaire just to keep the whole ruse going—like a grand carnival trick, a lottery winner who makes the rest of us keep buying tickets. But this system was never meant to elevate you. It was made to keep you hoping, praying, and slogging along in your bullshit job, saturating your mind with fantasies of “one day.”</span></p><p><strong>One day, one day, one day you will ascend. You will join them, dine with them, fuck their rich daughters, laugh at the dying peasants beneath your throne.</strong></p><p>You never realize they’re all fucking losers, and so are you.</p><p><span>Meanwhile, the wealth gap keeps widening. The top 1% hoard more and more, passing it on to their heirs, who, in turn, pass it on to theirs, and so forth, building a perpetual harem of obscene riches. They’ve got real estate in every major and minor city, stashed away trust funds, offshore accounts, private islands, entire corners of the planet as personal playgrounds—</span><strong>while you can barely afford the rent on your leaky apartment</strong><span>. They don’t give a fuck about you. Why would they? You’re a disposable cog in </span><em>their</em><span> profit machine. You exist to keep the system afloat, not to question it. You are an embarrassment.</span></p><p><strong>You have more in common with the homeless person on the street</strong><span> than with the lords of capital. </span><strong>Read that again.</strong><span> Yet you’re fed a narrative that the homeless are lazy, or that they “chose” their fate, while the billionaire is a shining beacon of entrepreneurial success. </span><strong>Wake the fuck up, samurai.</strong><span> There’s a reason they’re sinking millions into PR campaigns and philanthropic vanity projects: to maintain the illusion of being “good guys,” so you won’t unite against them in a glorious storm of ultra-violent class solidarity.</span></p><p>It’s so easy to blame yourself for not working hard enough. It’s so easy to idolize people like Elon Musk or Jeff Bezos or Donald Trump, to retweet their “inspiring” quotes or watch their interviews like they’re prophets of some new fucked up religion. We got enough of those. They’re playing you. They suck up obscene wealth created by countless workers—warehouse workers pissing in bottles, gig drivers sleeping in their cars, lab researchers on short-term contracts, engineers burning out daily, the poor and homeless always a warning—and then toss you a rotten bone.</p><p><strong>It’s time to burn that entire dream to the ground</strong><span>—not your own dreams, but the corporate propaganda. You want a real dream? Dream of a world where you’re not paying half your paycheck to a landlord who’s never fixed a thing in your apartment. Dream of a society where you don’t have to decide between medical treatment or feeding your kids. Dream of a community that invests in your well-being, your education, your mental health. Dream of a world that doesn’t slaughter innocents. Dream of a world where ALL share the fruits of progress. Dream of </span><strong>true liberty</strong><span>: freedom from the shackles of wage labor, from the desperation that compels you to bow your head and accept humiliation.</span></p><p><span>Dream, if not for you, for the countless others. Even if you do not suffer, even if you’re comfortable, all </span><em>that </em><span>is built on the suffering of others.</span></p><p><span>They’ve convinced you that the system’s rigged in your favor (with a little elbow grease), when in truth, it’s rigged </span><em>against</em><span> you from the second you’re born without generational wealth. This is a system built by them, </span><em>for them</em><span>. They taught you to look down on those below you rather than </span><strong>question why the fuck there’s a ladder in the first place.</strong><span> They taught you to scratch and claw your way up the rung, fighting others for the measly scraps. Meanwhile, the top rung is locked behind a gate that’s guarded by an army of lawyers, lobbyists, PR experts, and politicians on their payroll.</span></p><p><strong>Think about it</strong><span>: every time you see some working-class person praising the billionaire’s success story, doesn’t it feel like they’re praising a jailer for building a slightly bigger cell? We need to break the fuck free, not admire the shiny steel bars. This planet is set ablaze by their industries, oceans choked with plastic from their profit-driven shipping. They hoard resources and then preach charity as if they’re doing us a favor. And you keep chasing their acceptance, their lifestyle, as if it’s the promised land. It’s not. It’s a labyrinth rigged with illusions and soul-sucking corridors.</span></p><p><strong>Class solidarity</strong><span> is the only way out. Stop idolizing those rich cunts and start standing with those by your side. You’re not going to buy a one-way ticket to the top of the pyramid. Start building real bonds with people who also struggle with rent, medical bills, student loans, child care, soul-crushing office jobs, gig-economy chaos, the entire dystopian hamster wheel. You’ll realize the power has always been with the collective—</span><em>if</em><span> we decide to wield it. If we refuse to be pitted against each other by bullshit identity wars and blame games.</span></p><p><strong>Yes, it’s a revolution we need</strong><span>—a revolution of perspective, a revolution of the heart, and, down the line, a revolution in more tangible ways. Because you’re never going to change this system by playing its game, or by valiantly “working your way up.” And they are counting on you to keep believing that lie because it keeps you docile. It keeps you from storming the gates. It keeps you from pulling that entire facade down.</span></p><p><span>But look, you still have a choice, right here, right now: keep hustling for their scraps, keep your illusions alive and be disappointed for the rest of your life, or </span><strong>stand the fuck up</strong><span> and say: “Enough.” </span><strong>Demand better.</strong><span> Not just for yourself, but for everyone on this sinking ship. Demand an end to wage slavery, to exploitation, to the idea that you should sacrifice everything for some unattainable dream. Demand genuine democracy, not a capitalist democracy that’s bought and paid for by the highest bidder. Demand transparency. Demand the wealth that should belong to society, not to a handful of oligarchs playing Monopoly with our lives. </span><strong>Demand liberty</strong><span>, real liberty—the kind that sets your mind on fire and your heart pounding with possibility.</span></p><p><span>It’s time for you to grow up. Time for you to use your brain. </span><strong>Time to stop the daily humiliation.</strong><span> You are so fragile, so weak, so easily manipulated in your laughable attempts at domination and control. You wanna be a real man? A real man isn’t scared of ghosts; isn’t scared of minorities, isn’t scared of women having the same fucking rights as men, isn’t scared of complexity. Why the fuck are you always so scared?</span></p><p><span>You will never be a billionaire. They don’t want you. They never did. Show some fucking class—</span><em><strong>class consciousness</strong></em><span>—and turn that anger, that yearning, that energy toward solidarity with the rest of us stuck in the trenches. </span><strong>EVERY SINGLE ONE OF US.</strong><span> Stop believing them when they tell you that skin color, gender, nationality, religion, </span><em>anything</em><span> matters. You have believed too long. There’s us and them, nothing else. Just think, for fuck’s sake. </span><strong>How much more propaganda can you swallow?</strong><span> They’re laughing at our division, so very carefully orchestrated, they’re laughing at you. From their golden thrones, they are laughing.</span></p><p><strong>And the world stands at the abyss.</strong></p><p>Antonio</p><p><a href=\"https://www.amazon.com/stores/Antonio-Melonio/author/B0BRH6ZSTK\">Read my books</a><span>, if you haven’t done so yet. They’re all about revolution and anger. If you like my work, you can become a paid subscriber here on Substack or you can support me on </span><a href=\"https://www.patreon.com/c/antoniomelonio\">Patreon</a><span> and via </span><a href=\"https://www.paypal.com/paypalme/melonioantonio\">PayPal</a><span>. Thank you.</span></p><p>“Enjoy” this essay in video format:</p><div><p></p></div></div>",
      "author": "Antonio Melonio",
      "description": "",
      "dateAdded": "2025-01-29T18:09:16.000Z",
      "media": {
        "images": [
          {
            "url": "https://substackcdn.com/image/fetch/f_auto,q_auto:best,fl_progressive:steep/https%3A%2F%2Fbeneaththepavement.substack.com%2Fapi%2Fv1%2Fpost_preview%2F155937294%2Ftwitter.jpg%3Fversion%3D4",
            "alt": "You will never be a billionaire you stupid fuck",
            "isHero": true
          }
        ],
        "videos": []
      }
    }
  ]
}